### Pandas notes

In [1]:
import pandas as pd

In [2]:
!ls

MyPandasCheetSheet.ipynb  so_survey_2019.pdf        survey_results_schema.csv
README_2019.txt           survey_results_public.csv

### Think of Dict to DF ?

In [85]:
family = { 'fname': [ 'Shajiv' , ' Ammus' , 'monus'] ,
           'lname' : [ 'kalangath', 'Kandamattil' , 'shajiv'] ,
           'age' : [ 36 , 30 , 7] ,
         }

family.get('lname')

['kalangath', 'Kandamattil', 'shajiv']

In [86]:
 family_df = pd.DataFrame(family)

In [87]:
family_df

    fname        lname  age
0  Shajiv    kalangath   36
1   Ammus  Kandamattil   30
2   monus       shajiv    7

In [6]:
family_df['lname']

0      kalangath
1    Kandamattil
2         shajiv
Name: lname, dtype: object

### DataFrame and Series ( 1 D array or  single Column )

In [7]:
print(type(df))
print(type(family_df['lname']))
print(type(df[['fname','lname']]))

NameError: name 'df' is not defined

### We can access series in both the below ways

In [ ]:
family_df.fname ;

In [ ]:
family_df['fname']['fname']

In [ ]:
df = family_df

In [ ]:
df[['fname','lname']]

### To Get  the columns of the DF

In [ ]:
df.columns

# To get the Rows of the DF (iloc and loc )
## iloc = integer Location
## loc = Location

In [ ]:
# Get the first row 
df.iloc[0]

In [ ]:
# Get the second row which is a series
print(type(df.iloc[2]))
df.iloc[1]

In [ ]:
# get multiple rows row  1 and 2 
print(type(df.iloc[[0,1]]))
df.iloc[[0,1]]

In [ ]:
# get the rows and Coloumn
print(type(df.iloc[[0,1],[2]]))
df.iloc[[0,1],[2]]

In [ ]:
df

In [ ]:
df.loc[0]

In [ ]:
df.loc[[0,1]]

In [ ]:
df.loc[[0,1], ['age' ,'fname' ] ]

In [ ]:
# load the CSV file 
df1 = pd.read_csv('survey_results_public.csv')
df = df1

In [ ]:
df

In [ ]:
df.shape

In [ ]:
df.info()

In [ ]:
pd.set_option('display.max_columns',85)
pd.set_option('display.max_rows',85)

In [ ]:
schema_df = pd.read_csv('survey_results_schema.csv')

In [ ]:
schema_df

In [ ]:
df.head()

In [ ]:
####Shows only the first 8 i.e from 0 to 7 rows
df.head(8)

In [ ]:
schema_df

In [ ]:
df.columns

In [ ]:
df['df.iloc[[0,1,2,3], 2]'].value_counts()

In [ ]:
df.iloc[0,2]

In [ ]:
df.iloc[[0,1,2,3], 2]

In [ ]:
df.loc[[0,1,2,3], 'Hobbyist']

In [ ]:
## note we don't wrap when we use slicing ( including)
df.loc[0:3, 'Hobbyist']

In [ ]:
## note we don't wrap when we use slicing .May be the reason for Inclusive as we can use with the header 
df.loc[0:3, 'Hobbyist':'Employment']

In [ ]:
df = family_df
df

In [ ]:
df.index

In [ ]:
df.set_index('lname',inplace=True)

In [ ]:

df.index

In [ ]:
df

In [ ]:
df.loc['Kandamattil']

In [ ]:
df.loc['Kandamattil','age']

In [ ]:
df.reset_index(inplace=True)

In [ ]:
df

In [ ]:
!ls
df = pd.read_csv('survey_results_public.csv',index_col='Respondent')

In [ ]:
df.head()

In [ ]:
df.loc[1]

In [ ]:
!ls
schema_df = pd.read_csv('survey_results_schema.csv',index_col='Column')

In [ ]:
schema_df

In [ ]:
schema_df.loc['Hobbyist']

In [ ]:
schema_df.loc['MgrIdiot','QuestionText']

In [ ]:
schema_df.sort_index()

In [ ]:
schema_df.sort_index(ascending=False)

In [ ]:
schema_df.sort_index(inplace=True)

In [ ]:
schema_df

In [ ]:
df.head()

### Filtering you can use df.loc and also df [ [ blaah ]]
## df.loc you can specif the row and column

In [ ]:
# This will only give the boolean value and not the whole row 
df['Country'] == 'India'

In [ ]:
df[df['Country'] == 'India']

In [ ]:
# for accessing specific coloumns we can use this 
df[df['Country'] == 'India']['EdLevel']

In [ ]:
### Another way is using the df.loc where you can specigy the column 

df.loc[df['Country'] == 'India','Country']

In [ ]:
### more than one column should have in List 
df.loc[df['Country'] == 'India',['Country', 'LanguageWorkedWith', 'ConvertedComp']]

In [ ]:
### this shows we can set the filter in a variable and pass that to df or df.local
### Note Parantese is optional it is just for clarity 

filt =  ( df['ConvertedComp'] > 70000 )
df[filt]
df.loc[filt,['Country', 'LanguageWorkedWith', 'ConvertedComp']]

In [ ]:
## example how we can search from a lit "isin(list)"
countries = [ 'United States' , 'India' , 'United Kingdom' , 'Germany' , 'Canada']
filt = df [ 'Country'].isin(countries)

In [ ]:
df.loc[filt,'Country']

In [ ]:
### Example of using a sring method 
### YOu need to give the na=False attribute if not you will get "ValueError: cannot mask with array containing NA / NaN values" as it has some NaN value 

df['LanguageWorkedWith']
filt = df['LanguageWorkedWith'].str.contains('Python',na=False)

In [ ]:
df.loc[filt,['Country', 'LanguageWorkedWith', 'ConvertedComp']]

### Updating Rows and Columns ( Single Row)

In [88]:
 family_df

    fname        lname  age
0  Shajiv    kalangath   36
1   Ammus  Kandamattil   30
2   monus       shajiv    7

In [89]:
## we an also print or assign in different order like this 
family_df[['lname' , 'fname' , 'age']]

         lname   fname  age
0    kalangath  Shajiv   36
1  Kandamattil   Ammus   30
2       shajiv   monus    7

In [90]:

family_df.columns

Index(['fname', 'lname', 'age'], dtype='object')

In [91]:
# We can use list comprehension to update 
family_df.columns = [ item.capitalize() for item in family_df.columns ]
family_df

    Fname        Lname  Age
0  Shajiv    kalangath   36
1   Ammus  Kandamattil   30
2   monus       shajiv    7

In [92]:
family_df.columns

Index(['Fname', 'Lname', 'Age'], dtype='object')

In [95]:
# Replace with str.replace . Please note that there is no change nin Age colum as it doesn't have the match 

family_df.columns = family_df.columns.str.replace('name','_name')

In [96]:
family_df.columns

Index(['F_name', 'L_name', 'Age'], dtype='object')

In [97]:
# Replace specific column and note the inplace to make it persistent
family_df.rename(columns={'F_name': 'first_name' , 'L_name': 'sur_name'} , inplace=True)

In [98]:
family_df.columns

Index(['first_name', 'sur_name', 'Age'], dtype='object')

In [99]:
family_df.loc[2]

first_name     monus
sur_name      shajiv
Age                7
Name: 2, dtype: object

In [100]:
# Note if you don't give the same number of column then you get an "ValueError: Lengths must match to compare"

family_df.loc[2] = [ 'Aryan' , 'Shajiv' , 8]

In [101]:
family_df

  first_name     sur_name  Age
0     Shajiv    kalangath   36
1      Ammus  Kandamattil   30
2      Aryan       Shajiv    8

In [102]:
print( family_df.loc[2] == [ 'Aryan' , 'Shajiv' , 8 ])

first_name     True
sur_name       True
Age           False
Name: 2, dtype: bool

In [103]:
family_df

  first_name     sur_name  Age
0     Shajiv    kalangath   36
1      Ammus  Kandamattil   30
2      Aryan       Shajiv    8

In [104]:
family_df['Age'].dtype

dtype('int64')

In [105]:
## replace for one columns 
print(family_df.loc[2,'Age'])

8

In [108]:
family_df.loc[2,'Age'] = 7

In [109]:
family_df

  first_name     sur_name  Age
0     Shajiv    kalangath   36
1      Ammus  Kandamattil   30
2      Aryan       Shajiv    7

In [110]:
# replace Multiple Columns  , pass the list 
family_df.loc[2,['Age' , 'first_name']] = [ 8 , 'monu']

In [111]:
family_df

  first_name     sur_name  Age
0     Shajiv    kalangath   36
1      Ammus  Kandamattil   30
2       monu       Shajiv    8

In [112]:
# df.at can be used as well 
family_df.at[2,'Age'] = 7

In [113]:
family_df

  first_name     sur_name  Age
0     Shajiv    kalangath   36
1      Ammus  Kandamattil   30
2       monu       Shajiv    7

In [125]:
filt = family_df['Age'] == 36 
family_df[filt]

  first_name   sur_name  Age
0     Shajiv  kalangath   36

In [126]:
## Note if you don't us indexer like .loc or at it gives an warning to use the indexer ## 

#   /Users/monu/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning: 
#   A value is trying to be set on a copy of a slice from a DataFrame.
#   Try using .loc[row_indexer,col_indexer] = value instead
#   See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
#   """Entry point for launching an IPython kernel.
  
family_df[filt]['Age'] = 40

/Users/monu/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:9: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  if __name__ == '__main__':

In [127]:
#  you can do this like this to updat using indexers .loc 
filt = family_df['Age'] == 36
family_df.loc[filt , 'Age']  = 40

In [128]:
family_df

  first_name     sur_name  Age
0     Shajiv    kalangath   40
1      Ammus  Kandamattil   30
2       monu       Shajiv    7

In [132]:
#  you can do this like this to updat using indexers .at 
filt = family_df['Age'] == 40
family_df.at[filt , 'Age']  = 41

In [133]:
family_df

  first_name     sur_name  Age
0     Shajiv    kalangath   41
1      Ammus  Kandamattil   30
2       monu       Shajiv    7

# Updating Rows and Columns ( multiple  Rows)

In [136]:
family_df['sur_name']

0      kalangath
1    Kandamattil
2         Shajiv
Name: sur_name, dtype: object

In [137]:
## note this makes no change 
family_df['sur_name'].str.lower()

0      kalangath
1    kandamattil
2         shajiv
Name: sur_name, dtype: object

In [138]:
family_df

  first_name     sur_name  Age
0     Shajiv    kalangath   41
1      Ammus  Kandamattil   30
2       monu       Shajiv    7

In [139]:
# To assign the same column
family_df['sur_name'] = family_df['sur_name'].str.lower()

In [140]:
family_df

  first_name     sur_name  Age
0     Shajiv    kalangath   41
1      Ammus  kandamattil   30
2       monu       shajiv    7

## 4 methods to replace multiple rows apply,mpa,applymap and replace

### apply

In [144]:
family_df['sur_name'].apply(len)

0     9
1    11
2     6
Name: sur_name, dtype: int64